import React, { Component } from 'react';
import './BookDisplay.css';

const profile = {
  h1: 'Displaying some Book!',
  date: {
    d1: 'Рік видання',
    d2: 2019,
  },
  name: 'Фактор Черчилля. Як одна людина змінила історію',
  pages: {
    p1: 'Кількість сторінок',
    p2: 400,
  },
  genre: {
    g1: 'Жанр',
    g2: 'історичний, політичний, біографічний',
  },
  about: {
    a1: 'About',
    a2: 'Книжка Бориса Джонсона — це історія про те, як ексцентричний геній Черчилль, прем’єр-міністр Великої Британії, один з найвизначніших лідерів ХХ століття, сформував світову політику. Аналізуючи досягнення й помилки, а також міфи, які супроводжували цю видатну постать, Джонсон зобразив Черчилля як незрівнянного стратега, людину надзвичайно сміливу, красномовну й глибоко гуманну. Безстрашний на полі бою, один із найкращих ораторів усіх часів, лауреат Нобелівської премії з літератури, Вінстон Черчилль спростував думку, що історія — це місце дії великих знеособлених сил. Життя цього чоловіка є доказом того, що одна людина — відважна, геніальна, визначна — може впливати на світовий лад...',
    a3: 'Значну увагу Джонсон приділяє журналістській кар’єрі Черчилля та його письменницькому хистові. Це й не дивно: сам автор написав не одну книжку й працював журналістом (зокрема, у «The Daily Telegraph»). Стиль Черчилля, завважує Джонсон, не ґібонівський, а радше пишномовний і неокласицистично-вікторіянський. Він добре знав праці Ґібона та Маколея, сам писав про історію, формуючи унікальне розуміння подій. Це, на думку Джонсона, дало Черчиллю змогу сформувати чітке уявлення, що Великій Британії слід робити. Тож журналістські, історичні й біографічні праці були для нього «продовженням політичної справи». Джонсон підтримує це й намагається наслідувати, хоч цьому підходові Черчилля свого часу опонував Джон Пламб, який указував на поверхове розуміння історії та самовпевнену віру у велич Британії. На його переконання, «минуле — картонна процесія пишних подій, які ні на що не вказують і ніяк не спрямовують майбутнє».',
    a4: 'Для Джонсона Черчилль — так само історія, що є продовженням політичної справи автора. Як відомо, британського прем’єр-міністра вважали за одного з батьків-засновників ЕС, хоч він і відмовлявся приєднатися до процесу евроінтеґрації. 1946 року в Цюриху він заявляв: «Ми маємо створити Сполучені Штати Европи», проте участи Великої Британії в цьому процесі чітко не окреслив. У 1950-х роках Черчилль стверджував, що не бачить Британії членом «Федеративного Союзу Европи», але не відкидав ідею її участи в реґіональних організаціях. 18 липня 2018 року під час останньої промови Джонсона як міністра закордонних справ він звинувачував Терезу Мей у нерішучості й закликав рятувати Брекзит. У промовах і статтях автор апелює до постаті Черчилля, який нібито стикався з подібним під час Другої світової війни. Висновок Джонсона такий: «Іноді слід ухвалювати рішення, хоч це і є великим ризиком».',
    a5: 'Маємо, отже, цікавий приклад біографістики. З одного боку, автор залучає значну частину джерел (зокрема, неопублікованих) і дотримується принципу історизму, намагаючись відчути «дух епохи». Із другого — незграбно намагається допасувати минуле до сучасности, проводить дивні аналогії та відшуковує сумнівні причиново-наслідкові зв’язки. Попри це, книжку написано легко, і вона містить цікаві відомості про політика, до спадщини якого ми часто апелюємо нині, зокрема, наводячи вислови, які насправді Черчиллю не належать.',
  },
  author: {
    author: 'Автор',
    name: 'Боріс',
    surename: 'Джонсон',
  },
  src: 'https://img.imageboss.me/vsl/width/461/2022-10-20/%D1%84%D0%B0%D0%BA1.jpg',
};

class BookDisplay extends Component {
    render() {
      return (
        <>
        <hr></hr>
        <h1>{profile.h1}</h1>
        <div className='block'>
          <div className='table'>
          <table>
          <caption>{profile.name}<p></p></caption>
            <tbody>
              <tr><td>{profile.author.author}</td><td>{profile.author.name} {profile.author.surename}</td></tr>
              <tr><td>{profile.pages.p1}</td><td>{profile.pages.p2}</td></tr>
              <tr><td>{profile.date.d1}</td><td>{profile.date.d2}</td></tr>
              <tr><td>{profile.genre.g1}</td><td>{profile.genre.g2}</td></tr>
              <tr><td>{profile.about.a1}</td><td>{profile.about.a2}
                <p>{profile.about.a3}</p>
                <p>{profile.about.a4}</p>
                <p>{profile.about.a5}</p>
              </td></tr>
            </tbody>
          </table>
          </div>
          <div className='imgB'>
            <img src={profile.src} alt='img'></img>
          </div>
        </div>
        </>
      );
    }
}

export default BookDisplay;